Repository: ruben69695/hostbeat-win
Catalog: Hostbeat.App/Strings/*/Resources.resw
Source language: en
Languages: es

# AboutApp
source: This is a program made with the main idea of send heartbeats to the hostbeat platform and be able to be notified throught the mobile app when the host is disconnected from internet or is shuted down. There's also a CLI version made with Rust. To be able to see documentation or see the source code, please visit the next links using the buttons.
es: Este es un programa creado con la idea principal de enviar latidos a la plataforma hostbeat y poder ser notificado a través de la aplicación móvil cuando el host se desconecte de Internet o se apague. También hay una versión CLI hecha con Rust. Para poder ver la documentación o ver el código fuente, visite los siguientes enlaces usando los botones.

# AboutTab.Content
source: About
es: Acerca de

# AppDisplayName
source: Hostbeat Client
es: Cliente Hostbeat

# AutoStartCheckBox.Content
source: Auto send heartbeats on start
es: Envío automático de latidos al inicio

# Date.Text
source: Date
es: Fecha

# EnterInterval.Header
source: Heartbeat interval:
es: Intervalo entre latidos:

# EnterIntervalError.Message
source: This is not a valid interval
es: Este no es un intervalo válido.

# EnterToken.Header
source: Enter the token:
es: Introduce el token:

# EnterTokenError.Message
source: This is not a valid token
es: Este no es un token válida

# ErrorHostNotFound
source: Error sending heartbeat, host not found for current token
es: Error al enviar el latido, host no encontrado para el token actual

# ErrorTokenNotValid
source: Error sending heartbeat, token not valid
es: Error al enviar el latido, el token no es válido

# ErrorUnknown
source: Unknown error sending heartbeat , status code received: {0}
es: Error desconocido al enviar el latido, código de estado recibido: {0}

# ExitDialogCloseButtonText
source: Close
es: Cerramos

# ExitDialogContent
source: If you close the application, the heartbeats will stop being sent. Are you sure?
es: Si cierras la aplicación dejarán de enviarse los latidos.¿Estás seguro?

# ExitDialogPrimaryButtonText
source: Stay
es: Nos quedamos

# ExitDialogTitle
source: Remember
es: Recuerda

# HeartbeatSuccess
source: Heartbeat sended
es: Latido enviado

# HeartbeatTab.Content
source: Heartbeat
es: Latidos

# HyperlinkCli.Content
source: CLI App on GitHub
es: CLI App en GitHub

# HyperlinkWin.Content
source: This on Github
es: Esto en Github

# Message.Text
source: Message
es: Mensaje

# Save.Content
source: Save
es: Guardar

# SettingTab.Content
source: Settings
es: Ajustes

source: Start
es: Empezar

# Status.Text
source: Status
es: Estado

source: Stop
es: Parar
